## Financial stock datas using alpha vantage api

#### pip install MySQLdb

In [2]:
# Dependencies and Setup
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np
import requests
import time
import json
import requests
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine

In [3]:
# Build query Url and List of Stocks ticker
# https://www.alphavantage.co/query?function=TIME_SERIES_DAILY_ADJUSTED&symbol=GOOGL&apikey=Y5AE5LOO06SXQ60H
api_url = "https://www.alphavantage.co/query?function=TIME_SERIES_DAILY_ADJUSTED&symbol="
api_key = "Y5AE5LOO06SXQ60H"

# List of Stocks ticker
tickers = ["AAPL","CTSH","FB","GOOGL","IBM"]
#  tickers = ["MCD","MSFT","TSLA"]

In [4]:
# create and initialize list 
df_list = []
stock_symbol = []
stock_daily_details = []
stock_data = []

for ticker in tickers:
    try:
        url = api_url + ticker + "&apikey=" + api_key

        stock_details = requests.get(url).json()
        stock_symbol = stock_details["Meta Data"]["2. Symbol"]
        stock_daily_details = stock_details["Time Series (Daily)"]
#         print(stock_daily_details)

        # Save json data for each API call
        with open(f'assets/data/output_api_{ticker}.json', 'w') as outfile:
            json.dump(stock_daily_details, outfile)    

    # If an error is experienced, skip the ticker
    except:
        print("ticker not found. Skipping...")
        pass

In [6]:
# Build query Url and List of Stocks ticker
# https://www.alphavantage.co/query?function=TIME_SERIES_DAILY_ADJUSTED&symbol=GOOGL&apikey=Y5AE5LOO06SXQ60H
api_url = "https://www.alphavantage.co/query?function=TIME_SERIES_DAILY_ADJUSTED&symbol="
api_key = "Y5AE5LOO06SXQ60H"

# List of Stocks ticker
#tickers = ["AAPL","CTSH","FB","GOOGL","IBM","MCD","MSFT","TSLA"]
tickers = ["MCD","MSFT","TSLA"]

In [7]:
# create and initialize list 
df_list = []
stock_symbol = []
stock_daily_details = []
stock_data = []

for ticker in tickers:
    try:
        url = api_url + ticker + "&apikey=" + api_key

        stock_details = requests.get(url).json()
        stock_symbol = stock_details["Meta Data"]["2. Symbol"]
        stock_daily_details = stock_details["Time Series (Daily)"]
#         print(stock_daily_details)

        # Save json data for each API call
        with open(f'assets/data/output_api_{ticker}.json', 'w') as outfile:
            json.dump(stock_daily_details, outfile)    

    # If an error is experienced, skip the ticker
    except:
        print("ticker not found. Skipping...")
        pass

### Reading the json file

In [8]:
df_CTSH_t = pd.read_json("assets/data/output_api_CTSH.json")
df_GOOGL_t = pd.read_json("assets/data/output_api_GOOGL.json")
df_MSFT_t = pd.read_json("assets/data/output_api_MSFT.json")
df_TSLA_t = pd.read_json("assets/data/output_api_TSLA.json")
df_AAPL_t = pd.read_json("assets/data/output_api_AAPL.json")
df_IBM_t = pd.read_json("assets/data/output_api_IBM.json")
df_FB_t = pd.read_json("assets/data/output_api_FB.json")
df_MCD_t = pd.read_json("assets/data/output_api_MCD.json")

### Cleaning datas for Cognizant

In [9]:
df_CTSH = df_CTSH_t.transpose()

In [10]:
# renaming a column
df_CTSH = df_CTSH.rename(columns={'1. open': 'open','2. high': 'high','3. low': 'low','4. close': 'close',
                            '5. adjusted close': 'adjusted close','6. volume': 'volume',
                            '7. dividend amount': 'dividend amount','8. split coefficient': 'split coefficient'})

df_CTSH.head()

,open,high,low,close,adjusted close,volume,dividend amount,split coefficient
2019-06-07,62.24,62.980,62.150,62.78,62.78,2301147.0,0.0,1.0
2019-06-06,61.94,62.150,61.745,61.90,61.90,5228061.0,0.0,1.0
2019-06-05,61.73,62.235,61.280,62.18,62.18,6435408.0,0.0,1.0
2019-06-04,61.03,61.540,58.870,61.10,61.10,7812764.0,0.0,1.0
2019-06-03,61.77,62.100,60.130,60.54,60.54,7308487.0,0.0,1.0

In [11]:
df_CTSH_new = df_CTSH[["open", "high", "low","close","adjusted close","volume","dividend amount"]].copy()
df_CTSH_new.head()

,open,high,low,close,adjusted close,volume,dividend amount
2019-06-07,62.24,62.980,62.150,62.78,62.78,2301147.0,0.0
2019-06-06,61.94,62.150,61.745,61.90,61.90,5228061.0,0.0
2019-06-05,61.73,62.235,61.280,62.18,62.18,6435408.0,0.0
2019-06-04,61.03,61.540,58.870,61.10,61.10,7812764.0,0.0
2019-06-03,61.77,62.100,60.130,60.54,60.54,7308487.0,0.0

In [12]:
# change type to float
df_CTSH_new = df_CTSH_new.astype(float)

In [13]:
#  adding ticker column
df_CTSH_new ['tickers']= 'CTSH'

In [14]:
#reindexing 
df_CTSH_new = df_CTSH_new.reset_index()
df_CTSH_new.head()

,index,open,high,low,close,adjusted close,volume,dividend amount,tickers
0,2019-06-07,62.24,62.980,62.150,62.78,62.78,2301147.0,0.0,CTSH
1,2019-06-06,61.94,62.150,61.745,61.90,61.90,5228061.0,0.0,CTSH
2,2019-06-05,61.73,62.235,61.280,62.18,62.18,6435408.0,0.0,CTSH
3,2019-06-04,61.03,61.540,58.870,61.10,61.10,7812764.0,0.0,CTSH
4,2019-06-03,61.77,62.100,60.130,60.54,60.54,7308487.0,0.0,CTSH

In [15]:
# renaming a column
df_CTSH_new = df_CTSH_new.rename(columns={'index': 'dates'})

In [16]:
df_CTSH_new.head()

,dates,open,high,low,close,adjusted close,volume,dividend amount,tickers
0,2019-06-07,62.24,62.980,62.150,62.78,62.78,2301147.0,0.0,CTSH
1,2019-06-06,61.94,62.150,61.745,61.90,61.90,5228061.0,0.0,CTSH
2,2019-06-05,61.73,62.235,61.280,62.18,62.18,6435408.0,0.0,CTSH
3,2019-06-04,61.03,61.540,58.870,61.10,61.10,7812764.0,0.0,CTSH
4,2019-06-03,61.77,62.100,60.130,60.54,60.54,7308487.0,0.0,CTSH

### Connect to local database and load converted DataFrame into database

In [17]:
engine = create_engine('mysql+mysqlconnector://root:root123@127.0.0.1:3306/stock_db')

In [18]:
df_CTSH_new.to_sql(name='ctsh_Stock', con=engine, if_exists = 'append', index=False)

C:\Users\Owner\anaconda\Anaconda3\lib\site-packages\pandas\io\sql.py:1144: UserWarning: The provided table name 'ctsh_Stock' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  warnings.warn(msg, UserWarning)

In [19]:
pd.read_sql_query('select * from CTSH_Stock', con=engine).head()

,dates,open,high,low,close,adjusted close,volume,dividend amount,tickers
0,2019-06-07,62.24,62.980,62.150,62.78,62.78,2301147.0,0.0,CTSH
1,2019-06-06,61.94,62.150,61.745,61.90,61.90,5228061.0,0.0,CTSH
2,2019-06-05,61.73,62.235,61.280,62.18,62.18,6435408.0,0.0,CTSH
3,2019-06-04,61.03,61.540,58.870,61.10,61.10,7812764.0,0.0,CTSH
4,2019-06-03,61.77,62.100,60.130,60.54,60.54,7308487.0,0.0,CTSH

In [20]:
# Finally putting transformed dataframe to csv file
df_CTSH_new.to_csv('assets/csv/CTSH_stock_details.csv',index = True, header = True)

### Cleaning datas for Apple

In [21]:
# transposing the dataframe
df_AAPL = df_AAPL_t.transpose()

In [22]:
# renaming a column
df_AAPL = df_AAPL.rename(columns={'1. open': 'open','2. high': 'high','3. low': 'low','4. close': 'close',
                            '5. adjusted close': 'adjusted close','6. volume': 'volume',
                            '7. dividend amount': 'dividend amount','8. split coefficient': 'split coefficient'})

df_AAPL_new = df_AAPL[["open", "high", "low","close","adjusted close","volume","dividend amount"]].copy()
# change type to float
df_AAPL_new = df_AAPL_new.astype(float)
#  adding ticker column
df_AAPL_new ['tickers']= 'AAPL'

In [23]:
df_AAPL_new = df_AAPL_new.reset_index()
# renaming a column
df_AAPL_new = df_AAPL_new.rename(columns={'index': 'dates'})

In [24]:
df_AAPL_new.head()

,dates,open,high,low,close,adjusted close,volume,dividend amount,tickers
0,2019-06-07,186.51,191.92,185.7700,190.15,190.15,30648373.0,0.0,AAPL
1,2019-06-06,183.08,185.47,182.1489,185.22,185.22,22526311.0,0.0,AAPL
2,2019-06-05,184.28,184.99,181.1400,182.54,182.54,29773427.0,0.0,AAPL
3,2019-06-04,175.44,179.83,174.5200,179.64,179.64,30967961.0,0.0,AAPL
4,2019-06-03,175.60,177.92,170.2700,173.30,173.30,40396069.0,0.0,AAPL

### Connect to local database and load converted DataFrame into database

In [25]:
engine = create_engine('mysql+mysqlconnector://root:root123@127.0.0.1:3306/stock_db')
df_AAPL_new.to_sql(name='aapl_Stock', con=engine, if_exists = 'append', index=False)

C:\Users\Owner\anaconda\Anaconda3\lib\site-packages\pandas\io\sql.py:1144: UserWarning: The provided table name 'aapl_Stock' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  warnings.warn(msg, UserWarning)

In [26]:
pd.read_sql_query('select * from aapl_Stock', con=engine).head()

,dates,open,high,low,close,adjusted close,volume,dividend amount,tickers
0,2019-06-07,186.51,191.92,185.7700,190.15,190.15,30648373.0,0.0,AAPL
1,2019-06-06,183.08,185.47,182.1489,185.22,185.22,22526311.0,0.0,AAPL
2,2019-06-05,184.28,184.99,181.1400,182.54,182.54,29773427.0,0.0,AAPL
3,2019-06-04,175.44,179.83,174.5200,179.64,179.64,30967961.0,0.0,AAPL
4,2019-06-03,175.60,177.92,170.2700,173.30,173.30,40396069.0,0.0,AAPL

In [27]:
# Finally putting transformed dataframe to csv file
df_AAPL_new.to_csv('assets/csv/AAPL_stock_details.csv',index = True, header = True)

### Cleaning datas for Google

In [28]:
# transposing the dataframe
df_GOOGL = df_GOOGL_t.transpose()

In [29]:
# renaming a column
df_GOOGL = df_GOOGL.rename(columns={'1. open': 'open','2. high': 'high','3. low': 'low','4. close': 'close',
                            '5. adjusted close': 'adjusted close','6. volume': 'volume',
                            '7. dividend amount': 'dividend amount','8. split coefficient': 'split coefficient'})

df_GOOGL_new = df_GOOGL[["open", "high", "low","close","adjusted close","volume","dividend amount"]].copy()
# change type to float
df_GOOGL_new = df_GOOGL_new.astype(float)
#  adding ticker column
df_GOOGL_new ['tickers']= 'GOOGL'

In [30]:
df_GOOGL_new = df_GOOGL_new.reset_index()
# renaming a column
df_GOOGL_new = df_GOOGL_new.rename(columns={'index': 'dates'})

In [31]:
df_GOOGL_new.head()

,dates,open,high,low,close,adjusted close,volume,dividend amount,tickers
0,2019-06-07,1054.28,1073.43,1051.15,1068.37,1068.37,2170252.0,0.0,GOOGL
1,2019-06-06,1046.21,1050.00,1035.51,1047.76,1047.76,1451026.0,0.0,GOOGL
2,2019-06-05,1055.00,1056.81,1033.00,1044.64,1044.64,2349436.0,0.0,GOOGL
3,2019-06-04,1044.49,1058.44,1036.03,1054.49,1054.49,3025564.0,0.0,GOOGL
4,2019-06-03,1066.93,1067.00,1027.03,1038.74,1038.74,4844480.0,0.0,GOOGL

### Connect to local database and load converted DataFrame into database

In [32]:
engine = create_engine('mysql+mysqlconnector://root:root123@127.0.0.1:3306/stock_db')
df_GOOGL_new.to_sql(name='googl_Stock', con=engine, if_exists = 'append', index=False)

C:\Users\Owner\anaconda\Anaconda3\lib\site-packages\pandas\io\sql.py:1144: UserWarning: The provided table name 'googl_Stock' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  warnings.warn(msg, UserWarning)

In [33]:
pd.read_sql_query('select * from googl_Stock', con=engine).head()

,dates,open,high,low,close,adjusted close,volume,dividend amount,tickers
0,2019-06-07,1054.28,1073.43,1051.15,1068.37,1068.37,2170252.0,0.0,GOOGL
1,2019-06-06,1046.21,1050.00,1035.51,1047.76,1047.76,1451026.0,0.0,GOOGL
2,2019-06-05,1055.00,1056.81,1033.00,1044.64,1044.64,2349436.0,0.0,GOOGL
3,2019-06-04,1044.49,1058.44,1036.03,1054.49,1054.49,3025564.0,0.0,GOOGL
4,2019-06-03,1066.93,1067.00,1027.03,1038.74,1038.74,4844480.0,0.0,GOOGL

In [34]:
# Finally putting transformed dataframe to csv file
df_GOOGL_new.to_csv('assets/csv/GOOGL_stock_details.csv',index = True, header = True)

### Cleaning datas for Microsoft

In [35]:
# transposing the dataframe
df_MSFT = df_MSFT_t.transpose()

In [36]:
# renaming a column
df_MSFT = df_MSFT.rename(columns={'1. open': 'open','2. high': 'high','3. low': 'low','4. close': 'close',
                            '5. adjusted close': 'adjusted close','6. volume': 'volume',
                            '7. dividend amount': 'dividend amount','8. split coefficient': 'split coefficient'})

df_MSFT_new = df_MSFT[["open", "high", "low","close","adjusted close","volume","dividend amount"]].copy()
# change type to float
df_MSFT_new = df_MSFT_new.astype(float)
#  adding ticker column
df_MSFT_new ['tickers']= 'MSFT'

In [37]:
df_MSFT_new = df_MSFT_new.reset_index()
# renaming a column
df_MSFT_new = df_MSFT_new.rename(columns={'index': 'dates'})

In [38]:
df_MSFT_new.head()

,dates,open,high,low,close,adjusted close,volume,dividend amount,tickers
0,2019-06-07,129.19,132.25,128.2600,131.40,131.40,33844520.0,0.0,MSFT
1,2019-06-06,126.44,127.97,125.6000,127.82,127.82,21458961.0,0.0,MSFT
2,2019-06-05,124.95,125.87,124.2100,125.83,125.83,24926140.0,0.0,MSFT
3,2019-06-04,121.28,123.28,120.6522,123.16,123.16,29382642.0,0.0,MSFT
4,2019-06-03,123.85,124.37,119.0100,119.84,119.84,37983637.0,0.0,MSFT

### Connect to local database and load converted DataFrame into database

In [39]:
engine = create_engine('mysql+mysqlconnector://root:root123@127.0.0.1:3306/stock_db')
df_MSFT_new.to_sql(name='msft_Stock', con=engine, if_exists = 'append', index=False)

C:\Users\Owner\anaconda\Anaconda3\lib\site-packages\pandas\io\sql.py:1144: UserWarning: The provided table name 'msft_Stock' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  warnings.warn(msg, UserWarning)

In [40]:
pd.read_sql_query('select * from msft_Stock', con=engine).head()

,dates,open,high,low,close,adjusted close,volume,dividend amount,tickers
0,2019-06-07,129.19,132.25,128.2600,131.40,131.40,33844520.0,0.0,MSFT
1,2019-06-06,126.44,127.97,125.6000,127.82,127.82,21458961.0,0.0,MSFT
2,2019-06-05,124.95,125.87,124.2100,125.83,125.83,24926140.0,0.0,MSFT
3,2019-06-04,121.28,123.28,120.6522,123.16,123.16,29382642.0,0.0,MSFT
4,2019-06-03,123.85,124.37,119.0100,119.84,119.84,37983637.0,0.0,MSFT

In [41]:
# Finally putting transformed dataframe to csv file
df_MSFT_new.to_csv('assets/csv/MSFT_stock_details.csv',index = True, header = True)

### Cleaning datas for TSLA

In [42]:
# transposing the dataframe
df_TSLA = df_TSLA_t.transpose()

In [43]:
# renaming a column
df_TSLA = df_TSLA.rename(columns={'1. open': 'open','2. high': 'high','3. low': 'low','4. close': 'close',
                            '5. adjusted close': 'adjusted close','6. volume': 'volume',
                            '7. dividend amount': 'dividend amount','8. split coefficient': 'split coefficient'})

df_TSLA_new = df_TSLA[["open", "high", "low","close","adjusted close","volume","dividend amount"]].copy()
# change type to float
df_TSLA_new = df_TSLA_new.astype(float)
#  adding ticker column
df_TSLA_new ['tickers']= 'TSLA'

In [44]:
df_TSLA_new = df_TSLA_new.reset_index()
# renaming a column
df_TSLA_new = df_TSLA_new.rename(columns={'index': 'dates'})

In [45]:
df_TSLA_new.head()

,dates,open,high,low,close,adjusted close,volume,dividend amount,tickers
0,2019-06-07,205.00,210.8438,203.4990,204.50,204.50,15957667.0,0.0,TSLA
1,2019-06-06,204.44,211.0000,201.8000,205.95,205.95,20242151.0,0.0,TSLA
2,2019-06-05,198.68,201.2782,191.8486,196.59,196.59,13510756.0,0.0,TSLA
3,2019-06-04,181.10,193.9800,179.6100,193.60,193.60,13807522.0,0.0,TSLA
4,2019-06-03,185.51,186.6800,176.9919,178.97,178.97,13064410.0,0.0,TSLA

In [46]:
# Finally putting transformed dataframe to csv file
df_TSLA_new.to_csv('assets/csv/TSLA_stock_details.csv',index = True, header = True)

### Connect to local database and load converted DataFrame into database

In [47]:
engine = create_engine('mysql+mysqlconnector://root:root123@127.0.0.1:3306/stock_db')
df_TSLA_new.to_sql(name='tsla_Stock', con=engine, if_exists = 'append', index=False)

C:\Users\Owner\anaconda\Anaconda3\lib\site-packages\pandas\io\sql.py:1144: UserWarning: The provided table name 'tsla_Stock' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  warnings.warn(msg, UserWarning)

In [48]:
pd.read_sql_query('select * from tsla_Stock', con=engine).head()

,dates,open,high,low,close,adjusted close,volume,dividend amount,tickers
0,2019-06-07,205.00,210.8438,203.4990,204.50,204.50,15957667.0,0.0,TSLA
1,2019-06-06,204.44,211.0000,201.8000,205.95,205.95,20242151.0,0.0,TSLA
2,2019-06-05,198.68,201.2782,191.8486,196.59,196.59,13510756.0,0.0,TSLA
3,2019-06-04,181.10,193.9800,179.6100,193.60,193.60,13807522.0,0.0,TSLA
4,2019-06-03,185.51,186.6800,176.9919,178.97,178.97,13064410.0,0.0,TSLA

### Cleaning datas for IBM

In [49]:
# transposing the dataframe
df_IBM = df_IBM_t.transpose()

In [50]:
# renaming a column
df_IBM = df_IBM.rename(columns={'1. open': 'open','2. high': 'high','3. low': 'low','4. close': 'close',
                            '5. adjusted close': 'adjusted close','6. volume': 'volume',
                            '7. dividend amount': 'dividend amount','8. split coefficient': 'split coefficient'})

df_IBM_new = df_IBM[["open", "high", "low","close","adjusted close","volume","dividend amount"]].copy()
# change type to float
df_IBM_new = df_IBM_new.astype(float)
#  adding ticker column
df_IBM_new ['tickers']= 'IBM'

In [51]:
df_IBM_new = df_IBM_new.reset_index()
# renaming a column
df_IBM_new = df_IBM_new.rename(columns={'index': 'dates'})

In [52]:
df_IBM_new.head()

,dates,open,high,low,close,adjusted close,volume,dividend amount,tickers
0,2019-06-07,132.47,134.72,132.210,133.31,133.31,2553390.0,0.0,IBM
1,2019-06-06,132.19,132.65,130.900,132.22,132.22,2298248.0,0.0,IBM
2,2019-06-05,133.38,133.61,130.470,131.49,131.49,3161584.0,0.0,IBM
3,2019-06-04,129.56,132.74,129.085,132.69,132.69,3913535.0,0.0,IBM
4,2019-06-03,127.10,128.56,127.060,128.27,128.27,4267080.0,0.0,IBM

### Connect to local database and load converted DataFrame into database

In [53]:
engine = create_engine('mysql+mysqlconnector://root:root123@127.0.0.1:3306/stock_db')
df_IBM_new.to_sql(name='ibm_Stock', con=engine, if_exists = 'append', index=False)

C:\Users\Owner\anaconda\Anaconda3\lib\site-packages\pandas\io\sql.py:1144: UserWarning: The provided table name 'ibm_Stock' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  warnings.warn(msg, UserWarning)

In [54]:
pd.read_sql_query('select * from ibm_Stock', con=engine).head()

,dates,open,high,low,close,adjusted close,volume,dividend amount,tickers
0,2019-06-07,132.47,134.72,132.210,133.31,133.31,2553390.0,0.0,IBM
1,2019-06-06,132.19,132.65,130.900,132.22,132.22,2298248.0,0.0,IBM
2,2019-06-05,133.38,133.61,130.470,131.49,131.49,3161584.0,0.0,IBM
3,2019-06-04,129.56,132.74,129.085,132.69,132.69,3913535.0,0.0,IBM
4,2019-06-03,127.10,128.56,127.060,128.27,128.27,4267080.0,0.0,IBM

In [55]:
# Finally putting transformed dataframe to csv file
df_IBM_new.to_csv('assets/csv/IBM_stock_details.csv',index = True, header = True)

### Cleaning datas for FB

In [56]:
# transposing the dataframe
df_FB = df_FB_t.transpose()

In [57]:
# renaming a column
df_FB = df_FB.rename(columns={'1. open': 'open','2. high': 'high','3. low': 'low','4. close': 'close',
                            '5. adjusted close': 'adjusted close','6. volume': 'volume',
                            '7. dividend amount': 'dividend amount','8. split coefficient': 'split coefficient'})

df_FB_new = df_FB[["open", "high", "low","close","adjusted close","volume","dividend amount"]].copy()
# change type to float
df_FB_new = df_FB_new.astype(float)
#  adding ticker column
df_FB_new ['tickers']= 'FB'

In [58]:
df_FB_new = df_FB_new.reset_index()
# renaming a column
df_FB_new = df_FB_new.rename(columns={'index': 'dates'})

In [59]:
df_FB_new.head()

,dates,open,high,low,close,adjusted close,volume,dividend amount,tickers
0,2019-06-07,170.17,173.87,168.84,173.35,173.35,16906102.0,0.0,FB
1,2019-06-06,168.30,169.70,167.23,168.33,168.33,12446354.0,0.0,FB
2,2019-06-05,167.48,168.72,164.63,168.17,168.17,19758317.0,0.0,FB
3,2019-06-04,163.71,168.28,160.84,167.50,167.50,46044256.0,0.0,FB
4,2019-06-03,175.00,175.05,161.01,164.15,164.15,56059609.0,0.0,FB

### Connect to local database and load converted DataFrame into database

In [60]:
engine = create_engine('mysql+mysqlconnector://root:root123@127.0.0.1:3306/stock_db')
df_FB_new.to_sql(name='fb_Stock', con=engine, if_exists = 'append', index=False)

C:\Users\Owner\anaconda\Anaconda3\lib\site-packages\pandas\io\sql.py:1144: UserWarning: The provided table name 'fb_Stock' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  warnings.warn(msg, UserWarning)

In [61]:
pd.read_sql_query('select * from fb_Stock', con=engine).head()

,dates,open,high,low,close,adjusted close,volume,dividend amount,tickers
0,2019-06-07,170.17,173.87,168.84,173.35,173.35,16906102.0,0.0,FB
1,2019-06-06,168.30,169.70,167.23,168.33,168.33,12446354.0,0.0,FB
2,2019-06-05,167.48,168.72,164.63,168.17,168.17,19758317.0,0.0,FB
3,2019-06-04,163.71,168.28,160.84,167.50,167.50,46044256.0,0.0,FB
4,2019-06-03,175.00,175.05,161.01,164.15,164.15,56059609.0,0.0,FB

In [62]:
# Finally putting transformed dataframe to csv file
df_FB_new.to_csv('assets/csv/FB_stock_details.csv',index = True, header = True)

### Cleaning datas for Mcdonald's Corp

In [63]:
# transposing the dataframe
df_MCD = df_MCD_t.transpose()

In [64]:
# renaming a column
df_MCD = df_MCD.rename(columns={'1. open': 'open','2. high': 'high','3. low': 'low','4. close': 'close',
                            '5. adjusted close': 'adjusted close','6. volume': 'volume',
                            '7. dividend amount': 'dividend amount','8. split coefficient': 'split coefficient'})

df_MCD_new = df_MCD[["open", "high", "low","close","adjusted close","volume","dividend amount"]].copy()
# change type to float
df_MCD_new = df_MCD_new.astype(float)
#  adding ticker column
df_MCD_new ['tickers']= 'MCD'

In [65]:
df_MCD_new = df_MCD_new.reset_index()
# renaming a column
df_MCD_new = df_MCD_new.rename(columns={'index': 'dates'})

In [66]:
df_MCD_new.head()

,dates,open,high,low,close,adjusted close,volume,dividend amount,tickers
0,2019-06-07,203.50,206.39,203.50,205.48,205.48,4345033.0,0.0,MCD
1,2019-06-06,200.12,203.38,200.03,203.05,203.05,4657847.0,0.0,MCD
2,2019-06-05,200.08,200.56,199.25,200.13,200.13,4294736.0,0.0,MCD
3,2019-06-04,199.00,200.30,198.79,199.63,199.63,3829903.0,0.0,MCD
4,2019-06-03,198.36,199.10,197.32,198.78,198.78,3211789.0,0.0,MCD

### Connect to local database and load converted DataFrame into database

In [67]:
engine = create_engine('mysql+mysqlconnector://root:root123@127.0.0.1:3306/stock_db')
df_MCD_new.to_sql(name='mcd_Stock', con=engine, if_exists = 'append', index=False)

C:\Users\Owner\anaconda\Anaconda3\lib\site-packages\pandas\io\sql.py:1144: UserWarning: The provided table name 'mcd_Stock' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  warnings.warn(msg, UserWarning)

In [68]:
pd.read_sql_query('select * from mcd_Stock', con=engine).head()

,dates,open,high,low,close,adjusted close,volume,dividend amount,tickers
0,2019-06-07,203.50,206.39,203.50,205.48,205.48,4345033.0,0.0,MCD
1,2019-06-06,200.12,203.38,200.03,203.05,203.05,4657847.0,0.0,MCD
2,2019-06-05,200.08,200.56,199.25,200.13,200.13,4294736.0,0.0,MCD
3,2019-06-04,199.00,200.30,198.79,199.63,199.63,3829903.0,0.0,MCD
4,2019-06-03,198.36,199.10,197.32,198.78,198.78,3211789.0,0.0,MCD

In [69]:
# Finally putting transformed dataframe to csv file
df_MCD_new.to_csv('assets/csv/MCD_stock_details.csv',index = True, header = True)

### Concating the dataframe to eventually make a final dataframe

In [70]:
df_Final = pd.concat([df_CTSH_new, df_AAPL_new,df_GOOGL_new,df_TSLA_new,df_MSFT_new,df_IBM_new,df_FB_new,df_MCD_new]).drop_duplicates()
df_Final.head()

,dates,open,high,low,close,adjusted close,volume,dividend amount,tickers
0,2019-06-07,62.24,62.980,62.150,62.78,62.78,2301147.0,0.0,CTSH
1,2019-06-06,61.94,62.150,61.745,61.90,61.90,5228061.0,0.0,CTSH
2,2019-06-05,61.73,62.235,61.280,62.18,62.18,6435408.0,0.0,CTSH
3,2019-06-04,61.03,61.540,58.870,61.10,61.10,7812764.0,0.0,CTSH
4,2019-06-03,61.77,62.100,60.130,60.54,60.54,7308487.0,0.0,CTSH

In [71]:
# Sorting values of dates in decending order
df_sort = df_Final.sort_values(['dates'], ascending=[False])
# to do reset index
df_final_stock = df_sort.reset_index()
df_final_stock.head()

,index,dates,open,high,low,close,adjusted close,volume,dividend amount,tickers
0,0,2019-06-07,62.24,62.98,62.15,62.78,62.78,2301147.0,0.0,CTSH
1,0,2019-06-07,186.51,191.92,185.77,190.15,190.15,30648373.0,0.0,AAPL
2,0,2019-06-07,203.50,206.39,203.50,205.48,205.48,4345033.0,0.0,MCD
3,0,2019-06-07,170.17,173.87,168.84,173.35,173.35,16906102.0,0.0,FB
4,0,2019-06-07,132.47,134.72,132.21,133.31,133.31,2553390.0,0.0,IBM

In [72]:
df_stock = df_final_stock[["dates", "open", "high", "low", "close", "adjusted close", "volume", "dividend amount", "tickers"]].copy()
df_stock.head()

,dates,open,high,low,close,adjusted close,volume,dividend amount,tickers
0,2019-06-07,62.24,62.98,62.15,62.78,62.78,2301147.0,0.0,CTSH
1,2019-06-07,186.51,191.92,185.77,190.15,190.15,30648373.0,0.0,AAPL
2,2019-06-07,203.50,206.39,203.50,205.48,205.48,4345033.0,0.0,MCD
3,2019-06-07,170.17,173.87,168.84,173.35,173.35,16906102.0,0.0,FB
4,2019-06-07,132.47,134.72,132.21,133.31,133.31,2553390.0,0.0,IBM

### Final stock dataframe to csv

In [73]:
# Finally putting transformed dataframe to csv file
df_stock.to_csv('assets/csv/Final_stock_details.csv',index = True, header = True)